# ProgressDlgOpen

## Description
Show a progress dialog that doesn't interrupt the script. ProgressDlgClose must be used to close the dialog.

```pascal
PROCEDURE ProgressDlgOpen(
				title     : STRING;
				canCancel : BOOLEAN);
```

```python
def vs.ProgressDlgOpen(title, canCancel):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|title|STRING|   |
|canCancel|BOOLEAN|   |

## Examples
les can be found at [[VS:Progress Dialog]].

## See Also
ProgressDlgOpen | ProgressDlgClose | ProgressDlgSetTopMsg | ProgressDlgSetBotMsg | ProgressDlgSetMeter | ProgressDlgStart | ProgressDlgEnd | ProgressDlgHasCancel | ProgressDlgYeld

## Version
Availability: from Vectorworks 2015

## Category
* Utility